[{"Date":"2021-10-04 13:36:16.978593+08:00","Media":"Irish Examiner","Link":"https:\/\/www.irishexaminer.com\/news\/arid-40712633.html","Title":"Health minister urges pregnant women and older people to get flu vaccine this winter","Article":"Health minister Stephen Donnelly has urged those most vulnerable to get the free flu vaccine as the country heads into the winter.\n\nMr Donnelly called on anyone eligible for a jab to ensure they were protected from the flu and said that high uptake would also help ease the toll on Ireland’s fragile health system.\n\nAnyone aged 65 and over is eligible for a free flu vaccine, alongside healthcare workers and children aged between two and 17.\n\nPregnant women are also able to receive a free flu jab, as well as those with certain medical conditions.\n\n“As we emerge from the worst of the Covid-19 pandemic, it is vital to remember that there are other viruses that can take an enormous toll upon the most at-risk in our society, as well as those working in our healthcare system,\" Stephen Donnelly said.\n\nMr Donnelly also said that people should take the vaccine as soon as it’s offered to them.\n\nHealth Minister Stephen Donnelly (Niall Carson\/PA)\n\n“A flu vaccine will protect those aged over 65 from the very worst effects of flu. For healthcare workers, getting vaccinated means protecting themselves, their patients, and their families,\" he added.\n\n“Last year we saw encouraging uptake among healthcare workers and my hope is that this trend will continue this year.”\n\nBetween 200 and 500 people die from flu each winter.\n\nHealth officials are reminding people that the flu vaccine does not protect against Covid-19.\n\nDr Aparna Keegan, from the HSE’s National Immunisation Office, said that flu is a “serious illness”.\n\n“Although the severity of the flu season can vary, we know that people aged 65 and over are most likely to impacted and have an increased likelihood of severe illness, being admitted into hospital or dying from flu when compared to the general population.”\n\n“The flu vaccine is the best protection against flu this winter.”\n\nIreland has among the highest rates of Covid-19 vaccine take-up in Europe, with more than 91% of over-16s fully vaccinated.\n\nThe country has now moved to offering a booster vaccine to some vulnerable groups.\n\nHealth officials have said that it is safe to get the Covid-19 vaccine at the same time as a flu jab.","Summary":"Health minister Stephen Donnelly has urged those most vulnerable to get the free flu vaccine as the country heads into the winter.\nAnyone aged 65 and over is eligible for a free flu vaccine, alongside healthcare workers and children aged between two and 17.\nPregnant women are also able to receive a free flu jab, as well as those with certain medical conditions.\nHealth Minister Stephen Donnelly (Niall Carson\/PA)“A flu vaccine will protect those aged over 65 from the very worst effects of flu.\nHealth officials have said that it is safe to get the Covid-19 vaccine at the same time as a flu jab.","Image":"https:\/\/www.irishexaminer.com\/cms_media\/module_img\/5356\/2678381_2_seoimage16x9_2.34441879.jpg.jpg"},{"Date":"2021-10-04 21:24:10.394279+08:00","Media":"Mint","Link":"https:\/\/www.livemint.com\/insurance\/news\/health-insurance-premium-stable-in-jul-sep-says-report-11633324299442.html","Title":"Health insurance premium stable in Jul-Sep, says report","Article":"NEW DELHI: Premium for health insurance was largely stable during July-September, despite reports suggesting a rise in premium amid the pandemic, according to Insurance Price Index data for the third quarter of 2021, compiled by PolicyX.com, an insurance web aggregator.\n\n“The Health Insurance Price Index maintained tranquility with no change in the index value in Quarter 3, 2021. The Health Insurance Price Index has been persistent at Rs25,124 since Quarter 4, 2020. This is the result of no price hike in the 5 health insurance companies forming the part of the index,\" the report said.\n\nNaval Goel, founder and CEO, PolicyX.com, said, “It is great to see that the prices have not increased despite the fact that the insurance industry was hit by record Covid-19 claims and losses. Although the pandemic has resulted in a higher incidence of claims, there is an increased awareness of the need for insurance amongst the Indian population which should provide the impetus to help the industry grow faster.\"\n\nThe average payable premium by a 26-year-old across categories was Rs16,695 for Rs10 lakh sum insured, and Rs13,140 for a Rs5 lakh sum insured, highlighting the fact that premium does not increase proportionately with sum insured. From Rs5 lakh to Rs10 lakh sum insured, the premium rose 27% compared to a 100% increase in sum insured.\n\nAlso, adding members to the family floater policy does not increase the premium proportionately. In fact, there is a 50% increase of premium on an average on adding 1 more adult of the same age or lower age in the same policy. The increase is lower--11.9% and 13.7%--on adding first child and second child to the policy.\n\nOf the five companies, comprising the index, the variance observed in premiums among health companies was quite high, ranging from 59-76% for different age groups compared to variance observed among term insurance companies.\n\nThis is primarily because coverage, features, and benefits differ significantly for health insurance and term insurance.\n\nPremiums reported were average compiled from five health insurance companies for all age groups - 26 years, 36 years, 46 years, and 56 years and all coverage types i.e, 1 adult, 2 adults, 2 adults plus 1 child, and 2 adults plus 2 children.\n\nSubscribe to Mint Newsletters * Enter a valid email * Thank you for subscribing to our newsletter.","Summary":"NEW DELHI: Premium for health insurance was largely stable during July-September, despite reports suggesting a rise in premium amid the pandemic, according to Insurance Price Index data for the third quarter of 2021, compiled by PolicyX.com, an insurance web aggregator.\n“The Health Insurance Price Index maintained tranquility with no change in the index value in Quarter 3, 2021.\nThe Health Insurance Price Index has been persistent at Rs25,124 since Quarter 4, 2020.\nFrom Rs5 lakh to Rs10 lakh sum insured, the premium rose 27% compared to a 100% increase in sum insured.\nThis is primarily because coverage, features, and benefits differ significantly for health insurance and term insurance.","Image":"https:\/\/images.livemint.com\/img\/2021\/10\/04\/600x338\/health-insurance-kMkD--621x414@LiveMint_1633324865199.jpg"},{"Date":"2021-10-04 21:24:10.402281+08:00","Media":"The Straits Times","Link":"https:\/\/www.straitstimes.com\/singapore\/societal-cost-of-6-common-mental-health-disorders-estimated-at-17b-yearly-institute-of","Title":"Societal cost of 6 common mental health disorders estimated at $1.7b yearly: IMH study","Article":"SINGAPORE - A study by the Institute of Mental Health (IMH) has identified for the first time the societal cost of six common mental health disorders here, estimated at about $1.7 billion per year.\n\nIt found that the healthcare system or society would be expected to incur $3,938.90 more in total costs a year for an individual associated with these conditions compared with someone without a disorder.\n\nThe costs refer to healthcare utilisation costs and productivity loss.\n\nThe six common mental health disorders identified in the study are major depressive disorder, general anxiety disorder, bipolar disorder, obsessive compulsive disorder, alcohol abuse and alcohol dependence.\n\nThe $1.7 billion figure was derived from a 13.9 per cent prevalence rate of common mental health conditions among adults aged 18 and above, an estimated more than 433,000 persons, said IMH on Monday (Oct 4).\n\nThese findings were from the second Singapore Mental Health Study, initiated in 2016, which examined the prevalence of common mental health disorders here, their associated factors, treatment gap and the local adult population's help-seeking behaviour.\n\nThe study was led by IMH in collaboration with the Ministry of Health (MOH) and Nanyang Technological University, and funded by MOH and Temasek Foundation.\n\nA total of 6,126 participants representing the population were interviewed face-to-face between 2016 and 2018.\n\nTo establish costs, the study focused on four components - direct medical care, indirect medical care, intermediate and long-term care services, and productivity loss.\n\nIt found that the main drivers of costs were direct medical care and loss of productivity.\n\nThe cost of productivity loss in terms of absenteeism ($1,091.60) and presenteeism ($931) per year was found to be much higher in people with mental disorders than those without, which was $597.90 for absenteeism and $302.90 for presenteeism.\n\nAbsenteeism refers to the number of days out of the past 30 when individuals were \"totally unable to work or carry out normal activities due to problems with physical health, mental health, or use of alcohol or drugs\".\n\nPresenteeism refers to the number of days they had to \"cut back on the type or quantity of work\" due to the same problems.\n\nThe average annual excess costs - or additional expenses in terms of healthcare resource utilisation and productivity loss - incurred by a person with comorbid mental and chronic physical conditions were higher than those borne by someone with mental disorders or chronic physical conditions alone.\n\nComorbidity refers to the presence of two or more diseases or medical conditions in a patient.\n\nCompared with individuals without any mental disorders, those with mental illness tend to incur lower costs for visits to a primary care doctor (polyclinic doctor), restructured hospital allied health worker (for example, physiotherapist, nurse or medical social worker), dentist and traditional medicine practitioner (such as traditional Chinese medicine). But they chalk up higher bills for visits to a restructured hospital doctor and other private allied health workers.\n\nIn terms of services, they incur lower costs for hospital admissions, but higher expenses for accident and emergency as well as intermediate and long-term care services, compared with those without any mental disorders.\n\n\"Our findings show a substantial economic burden of mental disorders on our society - both in terms of direct medical costs and loss of productivity - and this is similar to studies done overseas,\" said Dr Edimansyah Abdin, principal biostatistician at IMH's research division.\n\nHe added: \"However, the total cost estimate of $1.7 billion is likely to be an underestimation of the true cost as the study did not include costs associated with caregiver burden, the use of justice system, peer support services, medications, supported (re-)employment programmes, other social services, and loss of earnings associated with unemployment.\n\n\"Also, our analysis in this study is limited to the six common disorders in Singapore and did not include other disorders such as schizophrenia.\"\n\nDr Mythily Subramaniam, assistant chairman of IMH's medical board (research), noted that mental health literacy and destigmatisation efforts are crucial for early intervention.\n\nThe provision of appropriate medical care and use of evidence-based practices will help manage the cost of healthcare utilisation, she said.\n\n\"A focus on occupational rehabilitation and workplace mental health support can help mitigate productivity loss,\" she added.\n\nShe noted that the prevalence of common mental disorders in Singapore is likely to increase in the future and will result in higher incremental cost to society.\n\n\"No country in the world can afford a steep escalation in healthcare costs or productivity loss. This further strengthens the case for prevention, early treatment and ancillary support services,\" she said.\n\nIMH provides psychiatric, rehabilitative and therapy services, trains psychiatrists and mental health professionals, and carries out mental health research.\n\nThe study findings come as the Covid-19 pandemic has shone a light on the importance of mental health.","Summary":"SINGAPORE - A study by the Institute of Mental Health (IMH) has identified for the first time the societal cost of six common mental health disorders here, estimated at about $1.7 billion per year.\nThe six common mental health disorders identified in the study are major depressive disorder, general anxiety disorder, bipolar disorder, obsessive compulsive disorder, alcohol abuse and alcohol dependence.\nThese findings were from the second Singapore Mental Health Study, initiated in 2016, which examined the prevalence of common mental health disorders here, their associated factors, treatment gap and the local adult population's help-seeking behaviour.\nAbsenteeism refers to the number of days out of the past 30 when individuals were \"totally unable to work or carry out normal activities due to problems with physical health, mental health, or use of alcohol or drugs\".\nIMH provides psychiatric, rehabilitative and therapy services, trains psychiatrists and mental health professionals, and carries out mental health research.","Image":"https:\/\/www.straitstimes.com\/s3\/files\/styles\/x_large\/public\/articles\/2021\/10\/04\/eb-health-100421.jpg?itok=NAMGDq1J"},{"Date":"2021-10-04 20:24:10.406278+08:00","Media":"HSJ","Link":"https:\/\/www.hsj.co.uk\/daily-insight\/the-primer-the-price-of-money\/7031014.article","Title":"The Primer: The price of money","Article":"The Primer provides a rapid guide to the most interesting comment and analysis on the English health and care sector that has not (usually) appeared in HSJ.\n\nWhenever the government issues a new spending settlement to the health service it’s wise to consider what is being demanded in return — what is the price the NHS must pay? Simply providing care is rarely enough.\n\nAll the more so when a Conservative government is taking major political heat in order to come up with the money, by putting up national insurance and holding down pensions.\n\nThe latest NHS planning guidance issued on Thursday confirms that, although NHS England has very wisely not agreed to hit any firm targets for the cash, it has agreed to keep elective waiting lists firmly at the top of the agenda, consuming the lion’s share of this year’s new money, and with incentives tweaked to prioritise “clock stops” over all else.\n\nBut in addition to actual delivery of service targets — or perhaps instead of them — another cost of the NHS’ latest dollop of cash became startlingly clear over the weekend, in the shape of a major new government review of leadership of health and social care, with a particular emphasis on efficiency.\n\nLeadership lessons for public services, in the Conservative playbook at least, must always come from either the military or business. So this review is led by a former vice-chief of the defence staff, General Sir Gordon Messenger. His number two is Dame Linda Pollard, the formidable chair of Leeds Teaching Hospitals Trust, formerly a successful marketer and business leader. Although it was trailed initially by the Tories on the eve of their autumn conference, you can read the official announcement here.\n\nOn Saturday’s Today programme Sajid Javid — a former Chancellor who will not have forgotten everything from the Treasury — all but confirmed the review was really about defending the spending growth, arguing he wanted to ensure “every penny” of new money was well spent. Perhaps he was displeased to hear people had been arguing (entirely accurately) that the money for health and care may not be enough to show much by way of firm results.\n\nIn the familiar truism, Mr Javid said some NHS leadership is excellent but there is variation. He wants to spread the good elsewhere, to bring improvements in outcomes and efficiency to all. Funnily enough, HSJ editor Alastair McLellan wrote just a week ago about how the leadership recruitment for integrated care systems risks compounding the “inverse leadership law” where patches with the worst problems don’t get the best bosses. One job of ICS is improvement of exactly those outcomes and care - with more than an eye on balancing the books, too, I expect.\n\nYet sadly, with most ICS chairs now hired and chief executive recruitment well under way, the review’s findings might come too late to take this big opportunity. If he wants to make an impact quickly, Mr Javid might want to step forward and help persuade the best people to get in and run difficult ICSs.\n\nBy announcing their leadership review as “the biggest in forty years”, the Conservatives are inviting comparison with the pivotal Griffiths report which, in the 1980s, did indeed augur a major overhaul of how the NHS was run.\n\nThe majority of informed observers will suspect that Sir Gordon’s effort, aside from offering a little political cover, will have no more impact than the countless leadership reviews which have taken place since then (ie: little). Some might even agree with what one NHS boss told the Guardian, that the review is about as welcome as “a vat of cold sick”.\n\nOne thing the announcement of the leadership review got right - though it’s been said plenty of times before - is that variation in care standards and outcomes between different areas are indeed alive and well out there.\n\nThe latest evidence on that neatly highlighted by the Institute of Public Policy Research last week, whose report, with analysis from the consultancy Carnall Farrar, includes an “integration index” for each ICS. Covered in the Independent, the report’s observations include that the rate of maternal deaths is 16 times higher in the Sussex and East Surrey ICS than it is in Suffolk and North East Essex, and that people with severe or complicated mental health problems in Bath and North East Somerset, Swindon and Wiltshire ICS are three times more likely to have a care coordinator than those in Leicester, Leicestershire and Rutland.","Summary":"The Primer provides a rapid guide to the most interesting comment and analysis on the English health and care sector that has not (usually) appeared in HSJ.\nWhenever the government issues a new spending settlement to the health service it’s wise to consider what is being demanded in return — what is the price the NHS must pay?\nAll the more so when a Conservative government is taking major political heat in order to come up with the money, by putting up national insurance and holding down pensions.\nPerhaps he was displeased to hear people had been arguing (entirely accurately) that the money for health and care may not be enough to show much by way of firm results.\nIn the familiar truism, Mr Javid said some NHS leadership is excellent but there is variation.","Image":"https:\/\/d3e6tmgg461bic.cloudfront.net\/Pictures\/1024x536\/8\/8\/3\/3052883_depositphotos_24559657_s2019_139281.jpg"},{"Date":"2021-10-04 20:24:10.409279+08:00","Media":"WOWK","Link":"https:\/\/www.wowktv.com\/news\/local\/kanawha-charleston-health-department-continues-to-vaccinate-west-virginians\/","Title":"Kanawha-Charleston Health Department continues to vaccinate West Virginians","Article":"CHARLESTON, WV (WOWK) — Another Sunday and another Kanawha-Charleston Health Department free COVID vaccinations and testing clinic.\n\nHere we found Jenny Adams of Charleston, whose granddaughter received her second shot.\n\n“She actually had to quarantine at home from school for a whole week because she had an exposure at school because she wasn’t fully vaccinated with both shots. She had to quarantine at home,” said Jenny Adams, a grandmother.\n\nStudents who have not had the second vaccination are required to quarantine after a COVID exposure, even if they are asymptomatic and test negative.\n\n“A lot of their students are being quarantined and having to miss out on those opportunities with school. That’s where we’re really happy to see them coming in getting that first and second dose,” said Dr. Sherri Young, Health Director of Kanawha-Charleston Health Department.\n\nAdams says, she is relieved knowing her granddaughter will be able to attend school in person.\n\n“So hopefully now she is fully vaccinated, and covered, and safe, and it won’t happen again,” said Adams.\n\nAs more young people get vaccinated, the health department hopes to slow down the spread.\n\n“It does affect their quarantine. They’re able to stay in school, they’re less likely to have COVID, or spread COVID, so it’s a win-win, especially when we get our young folks in here to get their vaccines,” said Young.\n\nFollow Katie Park on Facebook and Twitter to stay up-to-date with her reporting for 13 News!","Summary":"CHARLESTON, WV (WOWK) — Another Sunday and another Kanawha-Charleston Health Department free COVID vaccinations and testing clinic.\nStudents who have not had the second vaccination are required to quarantine after a COVID exposure, even if they are asymptomatic and test negative.\nThat’s where we’re really happy to see them coming in getting that first and second dose,” said Dr. Sherri Young, Health Director of Kanawha-Charleston Health Department.\nAs more young people get vaccinated, the health department hopes to slow down the spread.\nThey’re able to stay in school, they’re less likely to have COVID, or spread COVID, so it’s a win-win, especially when we get our young folks in here to get their vaccines,” said Young.","Image":"https:\/\/www.wowktv.com\/wp-content\/uploads\/sites\/52\/2021\/10\/66297fd69ddb416ab980066d48dbb640.jpg?w=1280"}]